import Mock from 'mockjs'
// const random = Mock.Random
const ganttData = function() {
  // const deliver = random.date()
  return Mock.mock({
    'viewData|17': [{
      'id|+1': 1,
      'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
        '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      start_date: '2020-' + '@integer(4, 6)-' + '@integer(10, 20)',
      personName: '@cname',
      duration: '@integer(4, 50)',
      'color|1': ['rgba(101,180,109,1)', 'rgba(230,165,107,1)', 'rgba(107,168,230,1)'],
      progress: '@integer(0.6)'
    }],
    'viewDataMarial|17': [{
      'id|+1': 1,
      'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
        '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      month: '@integer(4, 6)',
      day: '@integer(10, 20)',
      start_date: function() {
        if (this.id === 1) {
          return '2020-4-10'
        } else {
          return '2020-' + this.month + '-' + this.day
        }
      },
      personName: '@cname',
      duration: '@integer(2, 7)',
      'color|1': ['rgba(101,180,109,1)', 'rgba(230,165,107,1)', 'rgba(107,168,230,1)'],
      progress: '@integer(0.6)'
    }],
    'syncData|6': [{
      'id|+1': 1,
      'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
        '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      start_date: '2020-' + '@integer(4, 6)-' + '@integer(10, 20)',
      personName: '@cname',
      duration: '@integer(4, 50)',
      'color|1': ['rgba(101,180,109,1)', 'rgba(230,165,107,1)', 'rgba(107,168,230,1)'],
      progress: '@integer(0.6)'
    }],
    'syncDataview|36': [{
      'id|+1': 1,
      stand: function() {
        if (this.id === 3) {
          return 31
        } else if (this.id === 9) {
          return 41
        } else if (this.id === 15) {
          return 51
        } else if (this.id === 21) {
          return 52
        } else if (this.id === 27) {
          return 53
        } else if (this.id === 33) {
          return 54
        } else {
          return ''
        }
      },
      text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      start_date: '2020-' + '@integer(4, 6)-' + '@integer(10, 20)',
      personName: '@cname',
      duration: '@integer(4, 50)',
      'color|1': ['rgba(101,180,109,1)', 'rgba(230,165,107,1)', 'rgba(107,168,230,1)'],
      progress: '@integer(0.6)'
    }],
    'subData|17': [{
      'id|+1': 1,
      'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
        '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      start_date: '2020-' + '@integer(1, 11)-' + '@integer(10, 20)',
      personName: '@cname',
      duration: '@integer(1, 7)',
      'color|1': ['rgba(101,180,109,1)', 'rgba(230,165,107,1)', 'rgba(107,168,230,1)'],
      progress: '@integer(0.6)'
    }],
    'processData|20': [{
      'id|+1': 1,
      count: '@integer(1, 20)',
      'prepareState|1': ['符合', '部分', '不符合'],
      'problemState|1': ['未闭环', '正常'],
      'AONum|+1': 1,
      text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      start_date: function() {
        if (this.id === 1) {
          return '2020-3-1'
        } else if (this.id === 2) {
          return '2020-3-5'
        } else if (this.id === 3) {
          return '2020-3-9'
        } else if (this.id === 4) {
          return '2020-3-13'
        } else if (this.id === 5) {
          return '2020-3-18'
        } else if (this.id === 6) {
          return '2020-3-23'
        } else if (this.id === 7) {
          return '2020-3-27'
        } else {
          return '2020-3-' + this.count
        }
      },
      personName: '@cname',
      duration: function() {
        if (this.id === 1) {
          return 4
        } else if (this.id === 2) {
          return 4
        } else if (this.id === 3) {
          return 4
        } else if (this.id === 4) {
          return 5
        } else if (this.id === 5) {
          return 5
        } else if (this.id === 6) {
          return 4
        } else if (this.id === 7) {
          return 5
        } else {
          return 10
        }
      },
      color: function() {
        if (this.id < 8) {
          return 'rgba(230,165,107,1)'
        } else {
          return 'rgba(107,168,230,1)'
        }
      },
      // 'color|1': ['rgba(230,165,107,1)', 'rgba(107,168,230,1)'],
      progress: '@integer(0.6)',
      time: '@date',
      ptime: '@date',
      time1: '@date',
      ptime1: '@date',
      correlation: function() {
        if (this.id < 8) {
          return true
        }
      },
      planStartTime: function() {
        if (this.id === 1) {
          return '2020-03-01'
        } else if (this.id === 2) {
          return '2020-03-05'
        } else if (this.id === 3) {
          return '2020-03-09'
        } else if (this.id === 4) {
          return '2020-03-13'
        } else if (this.id === 5) {
          return '2020-03-18'
        } else if (this.id === 6) {
          return '2020-03-23'
        } else if (this.id === 7) {
          return '2020-03-27'
        } else {
          return '2020-03-15'
        }
      },
      planEndTime: function() {
        if (this.id === 1) {
          return '2020-03-04'
        } else if (this.id === 2) {
          return '2020-03-08'
        } else if (this.id === 3) {
          return '2020-03-12'
        } else if (this.id === 4) {
          return '2020-03-17'
        } else if (this.id === 5) {
          return '2020-03-22'
        } else if (this.id === 6) {
          return '2020-03-26'
        } else if (this.id === 7) {
          return '2020-03-31'
        } else {
          return '2020-03-25'
        }
      },
      activeStart: function() {
        if (this.id === 1) {
          return '2020-03-01'
        } else if (this.id === 2) {
          return '2020-03-05'
        } else if (this.id === 3) {
          return '2020-03-09'
        } else if (this.id === 4) {
          return '2020-03-13'
        } else if (this.id === 5) {
          return '2020-03-18'
        } else if (this.id === 6) {
          return '2020-03-23'
        } else if (this.id === 7) {
          return '2020-03-27'
        } else {
          return '2020-03-15'
        }
      },
      activeEnd: function() {
        if (this.id === 1) {
          return '2020-03-04'
        } else if (this.id === 2) {
          return '2020-03-08'
        } else if (this.id === 3) {
          return '2020-03-12'
        } else if (this.id === 4) {
          return '2020-03-17'
        } else if (this.id === 5) {
          return '2020-03-22'
        } else if (this.id === 6) {
          return '2020-03-26'
        } else if (this.id === 7) {
          return '2020-03-31'
        } else {
          return '2020-03-25'
        }
      },
      deliverNum: function() {
        if (this.id === 1) {
          return ''
        } else if (this.id === 2) {
          return 1
        } else if (this.id === 3) {
          return 2
        } else if (this.id === 4) {
          return 3
        } else if (this.id === 5) {
          return 4
        } else if (this.id === 6) {
          return 5
        } else if (this.id === 7) {
          return 6
        } else {
          return ''
        }
      }
    }],
    standData1: [
      {
        stand: '',
        id: '1',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-1-25',
        personName: '@cname',
        duration: '30',
        color: 'rgba(101,180,109,1)',
        progress: '@integer(0.6)'
      },
      {
        stand: '',
        id: '2',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-2-24',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      },
      {
        stand: '31',
        id: '3',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-3-20',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
    ],
    standData2: [
      {
        stand: '',
        id: '4',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-3-25',
        personName: '@cname',
        duration: '30',
        color: 'rgba(101,180,109,1)',
        progress: '@integer(0.6)'
      },
      {
        stand: '',
        id: '5',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-4-24',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      },
      {
        stand: '41',
        id: '6',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-5-22',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
    ],
    standData3: [
      {
        stand: '',
        id: '7',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-5-23',
        personName: '@cname',
        duration: '30',
        color: 'rgba(101,180,109,1)',
        progress: '@integer(0.6)'
      },
      {
        stand: '',
        id: '8',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-6-22',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      },
      {
        stand: '51',
        id: '9',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-7-24',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
    ],
    standData4: [
      {
        stand: '',
        id: '10',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-7-21',
        personName: '@cname',
        duration: '30',
        color: 'rgba(101,180,109,1)',
        progress: '@integer(0.6)'
      },
      {
        stand: '',
        id: '11',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-8-20',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      },
      {
        stand: '52',
        id: '12',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-9-15',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
    ],
    standData5: [
      {
        stand: '',
        id: '13',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-9-19',
        personName: '@cname',
        duration: '30',
        color: 'rgba(101,180,109,1)',
        progress: '@integer(0.6)'
      },
      {
        stand: '',
        id: '14',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-10-19',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      },
      {
        stand: '53',
        id: '15',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-11-12',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
    ],
    standData6: [
      {
        stand: '',
        id: '16',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-11-17',
        personName: '@cname',
        duration: '30',
        color: 'rgba(101,180,109,1)',
        progress: '@integer(0.6)'
      },
      {
        stand: '',
        id: '17',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-12-17',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      },
      {
        stand: '54',
        id: '18',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-12-30',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
    ],
    staData1: [
      {
        stand: '31',
        id: '1',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-1-25',
        personName: '@cname',
        duration: '30',
        color: 'rgba(101,180,109,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '',
      //   id: '2',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-2-26',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(230,165,107,1)',
      //   progress: '@integer(0.6)'
      // },
      // {
      //   stand: '31',
      //   id: '3',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-3-20',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData2: [
      // {
      //   stand: '',
      //   id: '4',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-5-20',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '41',
        id: '5',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-2-24',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '41',
      //   id: '6',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-7-22',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData3: [
      // {
      //   stand: '',
      //   id: '7',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-4-30',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '51',
        id: '8',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-3-25',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '51',
      //   id: '9',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-6-10',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData4: [
      // {
      //   stand: '',
      //   id: '10',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-8-2',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '52',
        id: '11',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-4-24',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '52',
      //   id: '12',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-10-1',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData5: [
      // {
      //   stand: '',
      //   id: '13',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-10-5',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '53',
        id: '14',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-5-24',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '53',
      //   id: '15',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-12-12',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData6: [
      // {
      //   stand: '',
      //   id: '16',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-4-20',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '54',
        id: '17',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-6-23',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '54',
      //   id: '18',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-6-6',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData11: [
      {
        stand: '31',
        id: '1',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-2-24',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '',
      //   id: '2',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-2-26',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(230,165,107,1)',
      //   progress: '@integer(0.6)'
      // },
      // {
      //   stand: '31',
      //   id: '3',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-3-20',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData12: [
      // {
      //   stand: '',
      //   id: '4',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-5-20',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '41',
        id: '5',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-3-25',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '41',
      //   id: '6',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-7-22',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData13: [
      // {
      //   stand: '',
      //   id: '7',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-4-30',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '51',
        id: '8',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-4-24',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '51',
      //   id: '9',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-6-10',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData14: [
      // {
      //   stand: '',
      //   id: '10',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-8-2',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '52',
        id: '11',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-5-24',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '52',
      //   id: '12',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-10-1',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData15: [
      // {
      //   stand: '',
      //   id: '13',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-10-5',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '53',
        id: '14',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-6-23',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '53',
      //   id: '15',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-12-12',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData16: [
      // {
      //   stand: '',
      //   id: '16',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-4-20',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '54',
        id: '17',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-7-23',
        personName: '@cname',
        duration: '30',
        color: 'rgba(230,165,107,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '54',
      //   id: '18',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-6-6',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData21: [
      {
        stand: '31',
        id: '1',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-3-25',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '',
      //   id: '2',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-2-26',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(230,165,107,1)',
      //   progress: '@integer(0.6)'
      // },
      // {
      //   stand: '31',
      //   id: '3',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-3-20',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData22: [
      // {
      //   stand: '',
      //   id: '4',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-5-20',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '41',
        id: '5',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-4-24',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '41',
      //   id: '6',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-7-22',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData23: [
      // {
      //   stand: '',
      //   id: '7',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-4-30',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '51',
        id: '8',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-5-24',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '51',
      //   id: '9',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-6-10',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData24: [
      // {
      //   stand: '',
      //   id: '10',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-8-2',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '52',
        id: '11',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-6-23',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '52',
      //   id: '12',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-10-1',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData25: [
      // {
      //   stand: '',
      //   id: '13',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-10-5',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '53',
        id: '14',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-7-23',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '53',
      //   id: '15',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-12-12',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData26: [
      // {
      //   stand: '',
      //   id: '16',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-4-20',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '54',
        id: '17',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-8-22',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '54',
      //   id: '18',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-6-6',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData31: [
      {
        stand: '31',
        id: '1',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-4-24',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
    ],
    staData32: [
      // {
      //   stand: '',
      //   id: '4',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-5-20',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '41',
        id: '5',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-5-24',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '41',
      //   id: '6',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-7-22',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData33: [
      // {
      //   stand: '',
      //   id: '7',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-4-30',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '51',
        id: '8',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-6-23',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '51',
      //   id: '9',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-6-10',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData34: [
      // {
      //   stand: '',
      //   id: '10',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-8-2',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '52',
        id: '11',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-7-23',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '52',
      //   id: '12',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-10-1',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData35: [
      // {
      //   stand: '',
      //   id: '13',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-10-5',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '53',
        id: '14',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-8-22',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '53',
      //   id: '15',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-12-12',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    staData36: [
      // {
      //   stand: '',
      //   id: '16',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-4-20',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(101,180,109,1)',
      //   progress: '@integer(0.6)'
      // },
      {
        stand: '54',
        id: '17',
        'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
          '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
        text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
        start_date: '2020-9-21',
        personName: '@cname',
        duration: '30',
        color: 'rgba(107,168,230,1)',
        progress: '@integer(0.6)'
      }
      // {
      //   stand: '54',
      //   id: '18',
      //   'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '升降舵34号拉杆组件',
      //     '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      //   text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      //   start_date: '2020-6-6',
      //   personName: '@cname',
      //   duration: '30',
      //   color: 'rgba(107,168,230,1)',
      //   progress: '@integer(0.6)'
      // }
    ],
    'stadardData1|6': function() {
      let allData = []
      allData = [...this.staData1, ...this.staData2, ...this.staData3, ...this.staData4, ...this.staData5, ...this.staData6]
      return allData
    },
    'stadardData2|6': function() {
      let allData = []
      allData = [...this.staData11, ...this.staData12, ...this.staData13, ...this.staData14, ...this.staData15, ...this.staData16]
      return allData
    },
    'stadardData3|6': function() {
      let allData = []
      allData = [...this.staData21, ...this.staData22, ...this.staData23, ...this.staData24, ...this.staData25, ...this.staData26]
      return allData
    },
    'stadardData4|6': function() {
      let allData = []
      allData = [...this.staData21, ...this.staData22, ...this.staData23, ...this.staData24, ...this.staData25, ...this.staData26]
      return allData
    },
    'allData|4': [{
      'id|+1': 20,
      'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板'],
      text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      month: '@integer(4, 6)',
      day: '@integer(10, 20)',
      start_date: function() {
        if (this.id === 20) {
          return '2020-4-10'
        } else {
          return '2020-' + this.month + '-' + this.day
        }
      },
      personName: '@cname',
      duration: '@integer(2, 7)',
      'color|1': ['rgba(101,180,109,1)', 'rgba(230,165,107,1)', 'rgba(107,168,230,1)'],
      progress: '@integer(0)'
    }],
    'standData|12': [{
      'id|+1': 30,
      'number|1': ['升降舵34号拉杆组件',
        '升降舵35号拉杆组件', '升降舵26号拉杆组件', '升降舵28号拉杆组件', '支座组件', '摇臂组件'],
      text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      month: '@integer(4, 6)',
      day: '@integer(10, 20)',
      start_date: function() {
        if (this.id === 30) {
          return '2020-4-10'
        } else {
          return '2020-' + this.month + '-' + this.day
        }
      },
      personName: '@cname',
      duration: '@integer(2, 7)',
      'color|1': ['rgba(101,180,109,1)', 'rgba(230,165,107,1)', 'rgba(107,168,230,1)'],
      progress: '@integer(0)'
    }],
    'originData|8': [{
      'id|+1': 50,
      'number|1': ['右后舱门外应急撤离灯衬板', '左后舱门外应急撤离灯衬板', '左前舱门外应急撤离灯衬板', '右前舱门外应急撤离灯衬板', '支座组件', '摇臂组件'],
      text: 'AO-ICI D3340T00000051-31-901' + '@integer(1, 6)',
      month: '@integer(4, 6)',
      day: '@integer(10, 20)',
      start_date: function() {
        if (this.id === 50) {
          return '2020-4-10'
        } else {
          return '2020-' + this.month + '-' + this.day
        }
      },
      personName: '@cname',
      duration: '@integer(2, 7)',
      'color|1': ['rgba(101,180,109,1)', 'rgba(230,165,107,1)', 'rgba(107,168,230,1)'],
      progress: '@integer(0)'
    }]
  })
}

export default [
  {
    url: '/cmm/ganttData/view\.*',
    type: 'get',
    response: config => {
      const ganttdata = ganttData
      return {
        status: 200,
        data: ganttdata,
        message: '查询成功'
      }
    }
  },
  {
    url: '/cmm/ganttData/part',
    type: 'post',
    response: config => {
      console.log(config.body)
      const typeData = ganttData
      return {
        status: 200,
        data: typeData,
        message: '查询成功'
      }
    }
  }
]
